# 03 - 판다스 데이터프레임 조회

## 3.데이터프레임 조회

- 보고자 하는 데이터를 즉시 조회할 수 있도록 반복 학습과 실습을 통해 익숙해져야 합니다.
- 데이터프레임을 대상으로 조회하는 방법은 다양합니다.
- 그 중 한 가지 방법을 선택해 일관되게 사용하기를 권고합니다.

In [25]:
# 라이브러리 불러오기
import pandas as pd

### (1) 데이터 읽어오기

* Attrition 데이터 불러오기

**[Attrition 데이터 셋 정보]**

|	구분	|	변수 명	|	내용	|	type	|	비고	|
|	----	|	----	|	----	|	----	|	----	|
|	**Target**	|	**Attrition**	|	이직여부, Yes , No	|	범주	| 1- 이직, 0- 잔류		|
|	feature	|	Age	|	나이	|	숫자	|		|
|	feature	|	DistanceFromHome	|	집-직장 거리	|	숫자	|	마일	|
|	feature	|	EmployNumber	|	사번	|	숫자	| 	|
|	feature	|	Gender	|	성별	|	범주	| Male, Female		|
|	feature	|	JobSatisfaction	|	직무 만족도	|	범주	|	1 Low, 2 Medium, 3 High, 4 Very High	|
|	feature	|	MaritalStatus	|	결혼상태	|	범주	| Single, Married, Divorced		|
|	feature	|	MonthlyIncome	|	월급	|	숫자	| 달러	|
|	feature	|	OverTime	|	야근여부	|	범주	|	Yes, No	|
|	feature	|	PercentSalaryHike	|	전년대비 급여인상율	|	숫자	|	%	|
|	feature	|	TotalWorkingYears	|	총 경력 연수	|	숫자	|		|

In [15]:
# 데이터 읽어오기
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/Attrition_simple2.CSV'
data = pd.read_csv(path)  

# 상위 5개 확인
data.head(5)

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
0,0,33,7,817,Male,3,Married,11691,No,11,14
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
4,1,22,4,593,Male,3,Single,3894,No,16,4

In [3]:
# 확인
data.head()

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
0,0,33,7,817,Male,3,Married,11691,No,11,14
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
4,1,22,4,593,Male,3,Single,3894,No,16,4

* 시리즈(Series)와 데이터프레임(DataFrame)
    * 데이터프레임 : 2차원 구조
    * 시리즈 : 1차원 구조
        * 데이터프레임에서 열 하나를 띄어 내면 시리즈!

<img src='https://github.com/DA4BAM/image/blob/main/%EC%8B%9C%EB%A6%AC%EC%A6%88,%20%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84.png?raw=true' width=500 align="left"/>

### (2) 특정 열 조회

- **df.loc[ : , [열 이름1, 열 이름2,...]]** 형태로 조회할 열 이름을 리스트로 지정합니다.
- 열 부분은 생략할 수 있었지만, **행 부분을 생략할 수는 없습니다.**
- 하지만 **df[[열 이름1, 열 이름2,...]]** 형태로 인덱서를 생략함이 일반적입니다.
- 조회할 열이 하나면 리스트 형태가 아니어도 됩니다.

In [6]:
# Attrition 열 조회 : 시리즈로 조회
# 좀 더 권장하는 방법!!!!!!!!!!!!!!!
data['Attrition']

0       0
1       0
2       0
3       0
4       1
       ..
1191    0
1192    0
1193    0
1194    0
1195    0
Name: Attrition, Length: 1196, dtype: int64

In [7]:
# Attrition 열 조회2 : 시리즈로 조회
# 오류 발생 가능성이 있음 비추!!
data.Attrition

0       0
1       0
2       0
3       0
4       1
       ..
1191    0
1192    0
1193    0
1194    0
1195    0
Name: Attrition, Length: 1196, dtype: int64

In [9]:
# Attrition, Age 열 조회 : 데이터프레임으로 조회
# 대괄호 안에 또 대괄호로 읽지 마시고, 대괄호 안에 리스트!!!
# 칼럼에다가 리스트를 집어넣으면 결과는 데이터프레임이 된다.

data[['Attrition', 'Age' ]]

      Attrition  Age
0             0   33
1             0   35
2             0   42
3             0   46
4             1   22
...         ...  ...
1191          0   32
1192          0   27
1193          0   29
1194          0   29
1195          0   43

[1196 rows x 2 columns]

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] data 데이터프레임에 대해 아래 요구사항에 맞는 구문을 작성하고 실행하세요.

In [10]:
# 상위 5개 행 조회
data.head(5)

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
0,0,33,7,817,Male,3,Married,11691,No,11,14
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
4,1,22,4,593,Male,3,Single,3894,No,16,4

In [11]:
# PercentSalaryHike 열만 조회
data['PercentSalaryHike']

0       11
1       11
2       13
3       23
4       16
        ..
1191    12
1192    11
1193    18
1194    14
1195    22
Name: PercentSalaryHike, Length: 1196, dtype: int64

In [19]:
#  Age, DistanceFromHome, Gender열만 조회
data[['Age', 'DistanceFromHome', 'Gender']]

      Age  DistanceFromHome  Gender
0      33                 7    Male
1      35                18    Male
2      42                 6    Male
3      46                 2  Female
4      22                 4    Male
...   ...               ...     ...
1191   32                 5  Female
1192   27                19    Male
1193   29                 9    Male
1194   29                 2    Male
1195   43                16  Female

[1196 rows x 3 columns]

In [20]:
# Age, DistanceFromHome, Gender열만 DistanceFromHome 열 기준으로 내림차순 정렬해서 조회
data[['Age', 'DistanceFromHome', 'Gender']].sort_values('DistanceFromHome',ascending = False)

      Age  DistanceFromHome  Gender
198    50                29    Male
245    32                29  Female
614    24                29    Male
810    48                29  Female
312    57                29    Male
...   ...               ...     ...
138    34                 1  Female
410    32                 1  Female
1050   28                 1  Female
778    33                 1    Male
124    35                 1  Female

[1196 rows x 3 columns]

In [25]:
data[['Age', 'DistanceFromHome', 'Gender']].sort_values(['DistanceFromHome','Age'],ascending = [False, True])

      Age  DistanceFromHome  Gender
614    24                29    Male
664    26                29    Male
307    28                29    Male
600    29                29    Male
180    30                29    Male
...   ...               ...     ...
1036   57                 1    Male
273    58                 1  Female
953    58                 1    Male
116    59                 1  Female
717    60                 1    Male

[1196 rows x 3 columns]

### (3) 조건으로 조회

- **df.loc[조건]** 형태로 조건을 지정해 조건에 만족하는 데이터만 조회할 수 있습니다.
- 우선 조건이 제대로 판단이 되는지 확인한 후 그 **조건을 대 괄호 안에** 넣으면 됩니다.

#### 1) 단일 조건 조회

In [24]:
# 조건절(조건문)의 결과는 True, False
data['DistanceFromHome'] > 10

0       False
1        True
2       False
3       False
4       False
        ...
1191    False
1192     True
1193    False
1194    False
1195     True
Name: DistanceFromHome, Length: 1196, dtype: bool

In [26]:
# DistanceFromHome 열 값이 10 보다 큰 행 조회
data.loc[data['DistanceFromHome'] > 10]

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
1,0,35,18,1412,Male,4,Single,9362,No,11,10
5,0,24,21,1551,Male,1,Divorced,2296,No,14,2
7,0,30,20,1084,Male,1,Married,9957,No,15,7
11,1,33,15,582,Male,3,Married,13610,Yes,12,15
15,0,34,23,60,Male,3,Single,4568,No,20,10
...,...,...,...,...,...,...,...,...,...,...,...
1181,0,35,28,1596,Male,3,Married,3407,No,17,10
1186,1,26,20,1818,Female,2,Married,2148,Yes,11,6
1188,0,29,19,1497,Male,3,Divorced,8620,No,14,10
1192,0,27,19,1619,Male,1,Divorced,4066,No,11,7
1195,0,43,16,327,Female,4,Married,16064,Yes,22,22

#### 2) 여러 조건 조회

- [ ]안에 조건을 여러개 연결할 때 **and와 or 대신에 &와 |**를 사용해야 합니다.
- 그리고 각 조건들은 **(조건1) & (조건2)** 형태로 **괄호**로 묶어야 합니다.

In [27]:
# and로 여러 조건 연결 10마일보다 크고, 만족도 높은사람 누구냐?
data.loc[(data['DistanceFromHome'] > 10) & (data['JobSatisfaction'] == 4)]

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
1,0,35,18,1412,Male,4,Single,9362,No,11,10
50,0,29,15,346,Male,4,Single,2340,No,19,6
51,0,45,28,1546,Male,4,Married,2132,No,20,8
64,0,32,15,1955,Female,4,Divorced,6667,No,18,9
82,1,35,12,1667,Male,4,Single,4581,Yes,24,13
...,...,...,...,...,...,...,...,...,...,...,...
1104,0,34,19,1701,Female,4,Married,2929,No,12,10
1126,0,35,11,1137,Male,4,Divorced,4968,No,11,5
1141,1,49,11,840,Female,4,Married,7654,No,18,9
1148,0,36,18,1133,Male,4,Single,7779,No,20,18
1195,0,43,16,327,Female,4,Married,16064,Yes,22,22

In [28]:
# or 조건 : |
# 둘중에 하나가 참이면 가져와라 |
data.loc[(data['DistanceFromHome'] > 10) | (data['JobSatisfaction'] == 4)]

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
1,0,35,18,1412,Male,4,Single,9362,No,11,10
5,0,24,21,1551,Male,1,Divorced,2296,No,14,2
7,0,30,20,1084,Male,1,Married,9957,No,15,7
8,0,26,6,686,Female,4,Married,2659,Yes,13,3
11,1,33,15,582,Male,3,Married,13610,Yes,12,15
...,...,...,...,...,...,...,...,...,...,...,...
1186,1,26,20,1818,Female,2,Married,2148,Yes,11,6
1188,0,29,19,1497,Male,3,Divorced,8620,No,14,10
1190,0,27,5,844,Male,4,Divorced,12808,Yes,16,9
1192,0,27,19,1619,Male,1,Divorced,4066,No,11,7
1195,0,43,16,327,Female,4,Married,16064,Yes,22,22

#### 3) isin(), between()

- **isin([값1, 값2,..., 값n])**: 값1 또는 값2 또는...값n인 데이터만 조회합니다.
- 주의 isin(**리스트**) 값들을 리스트 형태로 입력해야 합니다.

In [32]:
# 값 나열 소괄호안에 리스트
# | : or
# data.loc[(data['JobSatisfaction'] == 1) | (data['JobSatisfaction'] == 4)] 를 줄인 것이다.
data.loc[data['JobSatisfaction'].isin([1,4])]

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
5,0,24,21,1551,Male,1,Divorced,2296,No,14,2
7,0,30,20,1084,Male,1,Married,9957,No,15,7
...,...,...,...,...,...,...,...,...,...,...,...
1184,0,33,5,1395,Male,4,Married,9998,No,13,8
1185,0,24,10,1746,Male,4,Married,2145,No,14,3
1190,0,27,5,844,Male,4,Divorced,12808,Yes,16,9
1192,0,27,19,1619,Male,1,Divorced,4066,No,11,7
1195,0,43,16,327,Female,4,Married,16064,Yes,22,22

- 위 구문은 다음과 같은 의미를 갖습니다.

In [ ]:
# or 조건
data.loc[(data['JobSatisfaction'] == 1) | (data['JobSatisfaction'] == 4)]

- **between(값1, 값2)**: 값1 ~ 값2까지 범위안의 데이터만 조회합니다.

In [35]:
# 범위 지정
# & : and 
# 25 <= age <= 30
# data.loc[(data['Age'] >= 25) & (data['Age'] <= 30)] 을 줄인 것이다.
# betwwen( , ) ==>은 시작과 끝 값이 있어야 한다.
data.loc[data['Age'].between(25, 30)]

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
7,0,30,20,1084,Male,1,Married,9957,No,15,7
8,0,26,6,686,Female,4,Married,2659,Yes,13,3
16,0,30,5,197,Female,1,Divorced,3204,No,14,8
28,0,26,1,1893,Female,3,Married,2933,Yes,13,1
32,0,30,7,1224,Male,3,Divorced,3491,No,13,10
...,...,...,...,...,...,...,...,...,...,...,...
1188,0,29,19,1497,Male,3,Divorced,8620,No,14,10
1190,0,27,5,844,Male,4,Divorced,12808,Yes,16,9
1192,0,27,19,1619,Male,1,Divorced,4066,No,11,7
1193,0,29,9,1558,Male,3,Married,2451,No,18,5
1194,0,29,2,469,Male,3,Married,4649,No,14,4

- 위 구문은 다음과 같은 의미를 갖습니다.

In [ ]:
# and 조건
data.loc[(data['Age'] >= 25) & (data['Age'] <= 30)]

**4) 조건을 만족하는 행의 일부 열 조회**

- **df.loc[조건, ['열 이름1', '열 이름2',...]]** 형태로 조회할 열을 리스트로 지정합니다. ==> 2차원, 데이터프레임형태로 조회

In [36]:
# 조건에 맞는 하나의 열 조회
data.loc[data['MonthlyIncome'] >= 10000, ['Age']]

      Age
0      33
2      42
3      46
11     33
13     39
...   ...
1157   42
1158   54
1166   34
1190   27
1195   43

[230 rows x 1 columns]

In [37]:
# 조건에 맞는 여러 열 조회
data.loc[data['MonthlyIncome'] >= 10000, ['Age', 'MaritalStatus', 'TotalWorkingYears']]

      Age MaritalStatus  TotalWorkingYears
0      33       Married                 14
2      42       Married                 18
3      46       Married                 28
11     33       Married                 15
13     39        Single                 21
...   ...           ...                ...
1157   42        Single                 24
1158   54       Married                 36
1166   34        Single                 14
1190   27      Divorced                  9
1195   43       Married                 22

[230 rows x 3 columns]

## 문제) MaritalStatus 가 Single 이고, 나이가 30~40 인 직원을 월급순으로 정렬(내림차순)

In [40]:
#문제) MaritalStatus 가 Single 이고, 나이가 30~40 인 직원을 월급순으로 정렬(내림차순)
data.loc[(data['MaritalStatus']=='Single')&(data['Age'].between(30,40))].sort_values('MonthlyIncome',ascending = False)

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
1092,0,40,7,1740,Male,2,Single,19833,No,14,21
467,0,40,14,1128,Male,3,Single,19626,No,14,21
13,0,39,9,2022,Male,4,Single,19431,No,13,21
265,0,31,8,1430,Female,2,Single,16422,No,11,9
420,0,40,9,1166,Female,3,Single,13499,No,17,20
...,...,...,...,...,...,...,...,...,...,...,...
46,0,36,3,238,Male,2,Single,2088,No,12,13
568,0,36,7,1659,Male,2,Single,2013,No,11,15
26,1,32,2,1692,Male,2,Single,1393,No,12,1
301,1,31,8,1433,Female,2,Single,1261,No,12,1
1118,1,30,9,1876,Male,4,Single,1081,No,13,1

### (4) 복습문제

1) pandas 라이브러리를 pd 별칭을 주어 불러오세요.

In [1]:
# 라이브러리 불러오기
import pandas as pd

2) read_csv() 함수를 사용해 다음 경로의 파일을 불러와 **titanic** 데이터프레임을 만드세요.

- 파일 경로: 'https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv'

**[titanic_simple 데이터 셋 정보]**

- PassengerId : 승객번호
- Survived : 생존여부(1:생존, 0:사망)
- Pclass : 객실등급(1:1등급, 2:2등급, 3:3등급)
- Name : 승객이름
- Sex : 성별(male, female)
- Age : 나이
- Fare : 운임($)
- Embarked : 승선지역(Southhampton, Cherbourg, Queenstown)

In [19]:
# 파일 읽어오기
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv'
titanic = pd.read_csv(path)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southhampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southhampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southhampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southhampton

3) Name 열만 조회하세요.

In [6]:
# titanic['Name']
titanic.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

4) Name, Age, Sex 열만 조회하세요.

In [7]:
# titanic[['Name', 'Age', 'Sex']]
titanic.loc[:, ['Name', 'Age', 'Sex']]

                                                  Name   Age     Sex
0                              Braund, Mr. Owen Harris  22.0    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                               Heikkinen, Miss. Laina  26.0  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                             Allen, Mr. William Henry  35.0    male
..                                                 ...   ...     ...
886                              Montvila, Rev. Juozas  27.0    male
887                       Graham, Miss. Margaret Edith  19.0  female
888           Johnston, Miss. Catherine Helen "Carrie"   NaN  female
889                              Behr, Mr. Karl Howell  26.0    male
890                                Dooley, Mr. Patrick  32.0    male

[891 rows x 3 columns]

5) Name, Age, Sex 열의 상위 10개 행만 확인하세요.

In [8]:
titanic.loc[:, ['Name', 'Age', 'Sex']].head(10)

                                                Name   Age     Sex
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                             Heikkinen, Miss. Laina  26.0  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                           Allen, Mr. William Henry  35.0    male
5                                   Moran, Mr. James   NaN    male
6                            McCarthy, Mr. Timothy J  54.0    male
7                     Palsson, Master. Gosta Leonard   2.0    male
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0  female
9                Nasser, Mrs. Nicholas (Adele Achem)  14.0  female

6) 나이가 70세 이상인 탑승객을 조회하시오.

In [10]:
# 조건문
# titanic['Age']>=70
titanic.loc[titanic['Age']>=70]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,34.6542,Cherbourg
116,117,0,3,"Connors, Mr. Patrick",male,70.5,7.7500,Queenstown
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,49.5042,Cherbourg
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,30.0000,Southhampton
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,10.5000,Southhampton
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,71.0000,Southhampton
851,852,0,3,"Svensson, Mr. Johan",male,74.0,7.7750,Southhampton

In [11]:
titanic.loc[1]

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                         38.0
Fare                                                     71.2833
Embarked                                               Cherbourg
Name: 1, dtype: object

In [13]:
titanic.loc[1:10]

#1:10 ==> 1 부터 10전까지 1<= <10
#pandas의 loc는  1<= <=10 으로 출려된다.

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southhampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southhampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southhampton
5,6,0,3,"Moran, Mr. James",male,NaN,8.4583,Queenstown
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,51.8625,Southhampton
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,21.0750,Southhampton
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,11.1333,Southhampton
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,Cherbourg
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,16.7000,Southhampton

7) Fare(운임)의 평균을 Fare_mean으로 저장하고 그 값을 확인하세요.

In [20]:
Fare_mean = titanic['Fare'].mean()

8) 평균 운임보다 적게 내고 탑승한 승객을 조회하시오.

In [22]:
# titanic.loc[titanic['Fare']< Fare_mean]
titanic.loc[titanic['Fare']]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southhampton
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southhampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southhampton
5,6,0,3,"Moran, Mr. James",male,NaN,8.4583,Queenstown
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,21.0750,Southhampton
...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,Southhampton
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,Southhampton
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,23.4500,Southhampton
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,Cherbourg
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,Queenstown

9) 승선지역(Embarked)이 'Southhampton', 'Queenstown' 인 승객을 조회하시오.

In [23]:
titanic.loc[(titanic['Embarked'] == 'Southhampton') | (titanic['Embarked'] == 'Queenstown')]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southhampton
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southhampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southhampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southhampton
5,6,0,3,"Moran, Mr. James",male,NaN,8.4583,Queenstown
...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,Queenstown
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,Southhampton
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,Southhampton
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,23.4500,Southhampton
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,Queenstown

In [24]:
titanic.loc[titanic['Embarked'].isin(['Southhampton', 'Queenstown'])]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southhampton
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southhampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southhampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southhampton
5,6,0,3,"Moran, Mr. James",male,NaN,8.4583,Queenstown
...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,Queenstown
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,Southhampton
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,Southhampton
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,23.4500,Southhampton
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,Queenstown

10) 나이(Age)가 10대(10이상, 20 미만)인 남자 청소년의 평균 운임(Fare)을 구해 봅시다.

In [29]:
# 조건문
# (titanic['Age']>=10) & (titanic['Age']<20) & (titanic['Sex'] == 'male')

# 조회
# 1
temp = titanic.loc[(titanic['Age']>=10) & (titanic['Age']<20) & (titanic['Sex'] == 'male')]
temp['Fare'].mean()

25.308843859649123

In [30]:
# 2
titanic.loc[(titanic['Age']>=10) & (titanic['Age']<20) & (titanic['Sex'] == 'male')]['Fare'].mean()

25.308843859649123

In [31]:
# 3
titanic.loc[(titanic['Age']>=10) & (titanic['Age']<20) & (titanic['Sex'] == 'male'),'Fare'].mean()

25.308843859649123

In [32]:
# 4
titanic.loc[(titanic['Age'].between(10,20,inclusive='left')) & (titanic['Sex'] == 'male'),'Fare'].mean()

25.308843859649123

In [33]:
print(pd.__version__)

1.4.4

## 4.데이터프레임 집계

- 상세 데이터가 아닌 집계된 데이터에 대한 분석을 자주 요구하니 익숙해져야 할 내용입니다.
- sum(), mean(), max(), min(), count() 메소드를 사용해 지정한 열 또는 열들을 기준으로 집계합니다.
- 평균을 구하는 메소드가 avg()가 아닌 mean() 임을 주의하기 바랍니다.

In [34]:
# 라이브러리 불러오기
import pandas as pd

* Attrition 데이터 불러오기

**[Attrition 데이터 셋 정보]**

|	구분	|	변수 명	|	내용	|	type	|	비고	|
|	----	|	----	|	----	|	----	|	----	|
|	**Target**	|	**Attrition**	|	이직여부, Yes , No	|	범주	| 1- 이직, 0- 잔류		|
|	feature	|	Age	|	나이	|	숫자	|		|
|	feature	|	DistanceFromHome	|	집-직장 거리	|	숫자	|	마일	|
|	feature	|	EmployNumber	|	사번	|	숫자	| 	|
|	feature	|	Gender	|	성별	|	범주	| Male, Female		|
|	feature	|	JobSatisfaction	|	직무 만족도	|	범주	|	1 Low, 2 Medium, 3 High, 4 Very High	|
|	feature	|	MaritalStatus	|	결혼상태	|	범주	| Single, Married, Divorced		|
|	feature	|	MonthlyIncome	|	월급	|	숫자	| 달러	|
|	feature	|	OverTime	|	야근여부	|	범주	|	Yes, No	|
|	feature	|	PercentSalaryHike	|	전년대비 급여인상율	|	숫자	|	%	|
|	feature	|	TotalWorkingYears	|	총 경력 연수	|	숫자	|		|

In [35]:
# 데이터 읽어오기
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/Attrition_simple2.CSV'
data = pd.read_csv(path)  

# 상위 5개 확인
data.head(5)

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
0,0,33,7,817,Male,3,Married,11691,No,11,14
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
4,1,22,4,593,Male,3,Single,3894,No,16,4

### (1) 열 하나 집계

- 우선 특정 열의 값 합은 다음과 같이 구할 수 있습니다.

In [36]:
# MonthlyIncome 합계
data['MonthlyIncome'].sum()

7798045

In [37]:
# MonthlyIncome, TotalWorkingYears 각각의 평균
data[['MonthlyIncome', 'TotalWorkingYears']].mean()

MonthlyIncome        6520.104515
TotalWorkingYears      11.330268
dtype: float64

#### 1) 집계하기

- 만일 day 별로 합을 구하고자 한다면 다음과 같이 합니다.
- 아래 결과 값 네 개를 더하면 전체 합이 됩니다.
- **as_index=True**를 설정(기본값)하면 집계 기준이 되는 열이 인덱스 열이 됩니다.
- 집계 결과가 data 열만 가지니 **시리즈**가 됩니다.

In [38]:
# MaritalStatus 별 Age 평균 --> 시리즈
data.groupby('MaritalStatus', as_index=True)['Age'].mean()

MaritalStatus
Divorced    37.522727
Married     37.704380
Single      35.460938
Name: Age, dtype: float64

- **[['data']].sum()**과 같이 하면 열이 여럿이라는 의미여서 결과가 **데이터프레임**이 됩니다.

In [50]:
# MaritalStatus 별 Age 평균 --> 데이터프레임
data.groupby('MaritalStatus', as_index=True)['Age'].mean()
#True 는 칼럼이 하나
#False 는 칼럼이 2개

MaritalStatus
Divorced    37.522727
Married     37.704380
Single      35.460938
Name: Age, dtype: float64

- **as_index=False**를 설정하면 행 번호를 기반으로 한 정수 값이 인덱스로 설정됩니다.

In [41]:
# MaritalStatus 별 Age 평균 --> 데이터프레임
data.groupby('MaritalStatus', as_index=False)[['Age']].mean()

  MaritalStatus        Age
0      Divorced  37.522727
1       Married  37.704380
2        Single  35.460938

#### 2) 데이터프레임으로 선언

- 집계 결과를 새로운 데이터프레임으로 선언하여 사용하는 경우가 많습니다.
- 집계된 결과를 반복해서 사용하거나, 분석 대상이 되는 경우 데이터프레임으로 선언함이 유익합니다.

In [46]:
data_mean = data.groupby('MaritalStatus', as_index=False)[['Age']].mean()

# 확인
data_mean

  MaritalStatus        Age
0      Divorced  37.522727
1       Married  37.704380
2        Single  35.460938

### (2) 여러 열 집계

- 여러 열에 대한 집계를 같이 할 수 있습니다.
- **[ ['feature1', 'feature2'] ].sum()** 형태와 같이 집계 대상 열을 리스트로 지정합니다.

In [49]:
data_mean = data.groupby('MaritalStatus', as_index=False)[['Age','MonthlyIncome']].mean()

# 확인
data_mean

  MaritalStatus        Age  MonthlyIncome
0      Divorced  37.522727    6707.018939
1       Married  37.704380    6880.144161
2        Single  35.460938    5877.794271

- sum() 메소드 앞에 아무 열도 지정하지 않으면 **기준열 이외의 모든 열에 대한 집계**가 수행됩니다.

In [51]:
data_sum = data.groupby('MaritalStatus', as_index=False).sum()

# 확인
data_sum

,MaritalStatus,Attrition,Age,DistanceFromHome,EmployeeNumber,JobSatisfaction,MonthlyIncome,PercentSalaryHike,TotalWorkingYears
0,Divorced,23,9906,2404,266305,716,1770653,3958,3106
1,Married,69,20662,5295,584446,1468,3770319,8431,6470
2,Single,103,13617,3374,387862,1065,2257073,5852,3975

- **by=['feature1', 'feature2']** 과 같이 집계 기준 열을 여럿 설정할 수도 있습니다.

In [52]:
# 'MaritalStatus', 'Gender'별 나머지 열들 평균 조회
# 여러개를 집어넣을때는 리스트로 넣어야 한다.
data_sum = data.groupby(['MaritalStatus', 'Gender'], as_index=False)[['Age','MonthlyIncome']].mean()

# 확인
data_sum

  MaritalStatus  Gender        Age  MonthlyIncome
0      Divorced  Female  37.010526    6626.315789
1      Divorced    Male  37.810651    6752.384615
2       Married  Female  38.774194    7301.493088
3       Married    Male  37.003021    6603.912387
4        Single  Female  35.261146    5963.445860
5        Single    Male  35.599119    5818.555066

### (3) 여러 함수로 한꺼번에 집계 .agg

* df.groupby(  )**.agg(['함수1','함수2', ...])**

In [53]:
data_agg = data.groupby('MaritalStatus', as_index=False)[['MonthlyIncome']].agg(['min','max','mean'])
# 확인
data_agg

              MonthlyIncome
                        min    max         mean
MaritalStatus
Divorced               1129  19973  6707.018939
Married                1052  19999  6880.144161
Single                 1009  19926  5877.794271

* 예외 : as_index
    * .agg()를 사용하면 as_index = False 해도, 인덱스를 ~~~ 별 칼럼이 인덱스로 들어간다.

예외 : as_index .agg()를 사용하면 as_index = False 해도, ~~ 별 칼럼이 인덱스로 들어간다.

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] 데이터를 불러와 데이터프레임으로 저장합니다.

- 파일 경로 : https://raw.githubusercontent.com/DA4BAM/dataset/master/airquality.csv

**[airquality_simple 데이터 셋 정보]**

- Ozone : 오존농도
- Solar.R: 태양복사열
- Wind: 풍속
- Temp: 기온
- Month: 월
- Day: 일

In [55]:
# 데이터 읽어오기
temp = pd.read_csv('https://raw.githubusercontent.com/DA4BAM/dataset/master/airquality.csv')  

# 상위 5개 확인
temp.head()

   Ozone  Solar.R  Wind  Temp  Month  Day
0   41.0    190.0   7.4    67      5    1
1   36.0    118.0   8.0    72      5    2
2   12.0    149.0  12.6    74      5    3
3   18.0    313.0  11.5    62      5    4
4    NaN      NaN  14.3    56      5    5

[문2] 월별 Ozone, Wind, Temp 평균을 구해 봅시다.

In [57]:
# data_mean = teamp.groupby(['MaritalStatus', 'Gender'], as_index=False)[['Age','MonthlyIncome']].mean()

# data_mean

temp.groupby('Month', as_index = False)[['Ozone', 'Wind','Temp' ]].mean()

   Month      Ozone       Wind       Temp
0      5  23.615385  11.622581  65.548387
1      6  29.444444  10.266667  79.100000
2      7  59.115385   8.941935  83.903226
3      8  59.961538   8.793548  83.967742
4      9  31.448276  10.180000  76.900000

[문3] 월별 Ozone, Wind, Temp에 대해 최대, 최소, 평균, 표준편차 값을 구해 봅시다.

### (4) 복습문제

1) pandas 라이브러리를 pd 별칭을 주어 불러오세요.

In [ ]:
# 라이브러리 불러오기

2) read_csv() 함수를 사용해 다음 경로의 파일을 불러와 **titanic** 데이터프레임을 만드세요.

- 파일 경로: 'https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv'

**[titanic_simple 데이터 셋 정보]**

- PassengerId : 승객번호
- Survived : 생존여부(1:생존, 0:사망)
- Pclass : 객실등급(1:1등급, 2:2등급, 3:3등급)
- Name : 승객이름
- Sex : 성별(male, female)
- Age : 나이
- Fare : 운임($)
- Embarked : 승선지역(Southhampton, Cherbourg, Queenstown)

In [ ]:
# 파일 읽어오기

3) Fare의 중앙값을 확인해 봅시다.

4) 승선지역(Embarked)별 평균 운임(Fare)을 구해 봅시다.

5) 승선지역(Embarked)별, 성별(Sex)별 평균 운임(Fare)과 평균 나이(Age)를 tmp에 저장하고 조회하시오.

6) 5번의 결과로 부터 파악할 수 있는 내용은 무엇인가요?

7) 객실등급(Pclass)별, 생존여부(Survived)별 나이(Age), 운임(Fare)의 최대, 최소, 평균, 표준편차를 tmp에 저장하고 조회하시오.

### 연습